posts/2023/01/13/a-quick-function-to-delete-whitespace-in-lisp-programs.org
# -*- org-attach-id-dir: "../../../../files/attachments"; -*-
#+nikola-metadata: /home/sd80/programming/simoninireland.github.io/posts/2023/01/13/a-quick-function-to-delete-whitespace-in-lisp-programs.meta

