2023/01/13/a-quick-function-to-delete-whitespace-in-lisp-programs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>A quick function to delete whitespace in Lisp programs | Simon Dobson</title>
<link rel="icon" href="../../../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display%7CTangerine">
<link rel="stylesheet" href="../../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../../assets/css/code.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../../index.html">Home</a></li>
		    <li><a href="../../../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../../../research/">Research</a></li>
		    <li><a href="../../../../development/projects/">Software</a></li>
		    <li><a href="../../../../writing/">Writing</a></li>
		    <li><a href="../../../../personal/contact/">Contact</a></li>
		<li>
<a href="../../../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<div class="entry-meta">
	    <span class="posted-on">
		Posted on <a href="." rel="bookmark">Friday 13 January, 2023</a>
	    </span>
	</div>
	<h1>A quick function to delete whitespace in Lisp&nbsp;programs</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orgd0a15fe" class="outline-2">
<h2 id="orgd0a15fe">A quick function to delete whitespace in Lisp&nbsp;programs</h2>
<div class="outline-text-2" id="text-orgd0a15fe">
<p>
I&#8217;ve recently found myself constantly introducing – and then deleting –
whitespace when writing Lisp. A quick bit of Emacs hacking fixed&nbsp;it.
</p>

<!-- TEASER_END -->

<p>
I&#8217;ve started using <a href="http://paredit.org/">paredit</a> as a structure editor for Lisp programs.
Once I got used to the movement commands it&#8217;s greatly speeded-up my
editing. However, when I&#8217;m editing functions, I find that I
introduce a lot of extraneous whitespace when I&#8217;m moving forms
around. Mostly this comes when I leave <i>myself</i> space at the end of
a function to add something later, or when I delete or move code&nbsp;around.
</p>

<p>
Now deleting whitespace is hardly the most time-consuming of tasks,
especially as paredit won&#8217;t let you accidentally remove a bracket in
the process. But in keeping with the Emacs philosophy of always
automating everything that even <i>slightly</i> annoys you, I started
wondering: can I delete whitespace more effectively? Specifically,
can I delete all the whitespace from a closing bracket back to the
code that it closes, in one&nbsp;command?
</p>

<p>
paredit has a function that sort of does what I had in&nbsp;mind:
</p>

<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nf">defun</span><span class="w"> </span><span class="nv">paredit-delete-leading-whitespace</span><span class="w"> </span><span class="p">()</span>
<span class="w">    </span><span class="c1">;; This assumes that we're on the closing delimiter already.</span>
<span class="w">    </span><span class="p">(</span><span class="nf">save-excursion</span>
<span class="w">      </span><span class="p">(</span><span class="nf">backward-char</span><span class="p">)</span>
<span class="w">      </span><span class="p">(</span><span class="k">while</span><span class="w"> </span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">syn</span><span class="w"> </span><span class="p">(</span><span class="nf">char-syntax</span><span class="w"> </span><span class="p">(</span><span class="nf">char-before</span><span class="p">))))</span>
<span class="w">               </span><span class="p">(</span><span class="k">and</span><span class="w"> </span><span class="p">(</span><span class="k">or</span><span class="w"> </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?</span><span class="err">\</span><span class="w"> </span><span class="p">)</span><span class="w"> </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?-</span><span class="p">))</span><span class="w">     </span><span class="c1">; whitespace syntax</span>
<span class="w">                    </span><span class="c1">;; The above line is a perfect example of why the</span>
<span class="w">                    </span><span class="c1">;; following test is necessary.</span>
<span class="w">                    </span><span class="p">(</span><span class="nb">not</span><span class="w"> </span><span class="p">(</span><span class="nf">paredit-in-char-p</span><span class="w"> </span><span class="p">(</span><span class="nb">1-</span><span class="w"> </span><span class="p">(</span><span class="nf">point</span><span class="p">))))))</span>
<span class="w">        </span><span class="p">(</span><span class="nf">delete-char</span><span class="w"> </span><span class="mi">-1</span><span class="p">))))</span>
</pre></div>

<p>
There are a couple of problems, though. The first is that it
isn&#8217;t interactive, so it can&#8217;t be bound to a key. It also won&#8217;t
cross a line boundary, whereas a lot of my code seems to end up with
blank lines in it. (Maybe I should just get&nbsp;tidier….)
</p>

<p>
My first attempt corrected these two&nbsp;shortcomings:
</p>

<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nf">defun</span><span class="w"> </span><span class="nv">sd/paredit-delete-whitespace</span><span class="w"> </span><span class="p">()</span>
<span class="w">    </span><span class="p">(</span><span class="nf">interactive</span><span class="p">)</span>
<span class="w">    </span><span class="p">(</span><span class="nf">save-excursion</span>
<span class="w">      </span><span class="p">(</span><span class="k">while</span><span class="w"> </span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">syn</span><span class="w"> </span><span class="p">(</span><span class="nf">char-syntax</span><span class="w"> </span><span class="p">(</span><span class="nf">char-before</span><span class="p">))))</span>
<span class="w">               </span><span class="p">(</span><span class="k">and</span><span class="w"> </span><span class="p">(</span><span class="k">or</span><span class="w"> </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?</span><span class="err">\</span><span class="w"> </span><span class="p">)</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?-</span><span class="p">)</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="p">(</span><span class="nf">line-beginning-position</span><span class="p">)</span><span class="w"> </span><span class="p">(</span><span class="nf">point</span><span class="p">)))</span>
<span class="w">                    </span><span class="p">(</span><span class="nb">not</span><span class="w"> </span><span class="p">(</span><span class="nf">paredit-in-char-p</span><span class="w"> </span><span class="p">(</span><span class="nb">1-</span><span class="w"> </span><span class="p">(</span><span class="nf">point</span><span class="p">))))))</span>
<span class="w">        </span><span class="p">(</span><span class="nf">delete-char</span><span class="w"> </span><span class="mi">-1</span><span class="p">))))</span>
</pre></div>

<p>
The <code>syn</code> variable gets the syntactic character class of the
character before point. Space and dash characters denote whitespace,
interchangeably. The third test checks whether we&#8217;re at the start of
a line, and the fourth checks that we&#8217;re not in the middle of a
character&nbsp;specification.
</p>

<p>
Of course, solving the original problem was never going to be
enough. I immediately realised that it&#8217;d be better to delete
whitespace <i>both</i> forwards <i>and</i> backwards, so that placing the
cursor anywhere in a block of whitespace would remove it&nbsp;all.
</p>

<p>
As I did this I started wondering about those tests for being at the
beginning or end of a line. This seems like a thing one would
naturally want to do, but it requires an explicit comparison. Or
does it? – no, of course it doesn&#8217;t, obviously there are functions for&nbsp;that, <code>bolp</code> and <code>eolp</code> respectively. The end result&nbsp;was:
</p>

<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nf">defun</span><span class="w"> </span><span class="nv">sd/paredit-delete-whitespace</span><span class="w"> </span><span class="p">()</span>
<span class="w">    </span><span class="p">(</span><span class="nf">interactive</span><span class="p">)</span>
<span class="w">    </span><span class="p">(</span><span class="nf">save-excursion</span>
<span class="w">      </span><span class="p">(</span><span class="k">while</span><span class="w"> </span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">syn</span><span class="w"> </span><span class="p">(</span><span class="nf">char-syntax</span><span class="w"> </span><span class="p">(</span><span class="nf">char-after</span><span class="p">))))</span>
<span class="w">               </span><span class="p">(</span><span class="k">and</span><span class="w"> </span><span class="p">(</span><span class="k">or</span><span class="w"> </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?</span><span class="err">\</span><span class="w"> </span><span class="p">)</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?-</span><span class="p">)</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">eolp</span><span class="p">)))</span>
<span class="w">                    </span><span class="p">(</span><span class="nb">not</span><span class="w"> </span><span class="p">(</span><span class="nf">paredit-in-char-p</span><span class="w"> </span><span class="p">(</span><span class="nb">1+</span><span class="w"> </span><span class="p">(</span><span class="nf">point</span><span class="p">))))))</span>
<span class="w">        </span><span class="p">(</span><span class="nf">forward-char</span><span class="p">))</span>

<span class="w">      </span><span class="p">(</span><span class="k">while</span><span class="w"> </span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">syn</span><span class="w"> </span><span class="p">(</span><span class="nf">char-syntax</span><span class="w"> </span><span class="p">(</span><span class="nf">char-before</span><span class="p">))))</span>
<span class="w">               </span><span class="p">(</span><span class="k">and</span><span class="w"> </span><span class="p">(</span><span class="k">or</span><span class="w"> </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?</span><span class="err">\</span><span class="w"> </span><span class="p">)</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?-</span><span class="p">)</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">bolp</span><span class="p">)))</span>
<span class="w">                    </span><span class="p">(</span><span class="nb">not</span><span class="w"> </span><span class="p">(</span><span class="nf">paredit-in-char-p</span><span class="w"> </span><span class="p">(</span><span class="nb">1-</span><span class="w"> </span><span class="p">(</span><span class="nf">point</span><span class="p">))))))</span>
<span class="w">        </span><span class="p">(</span><span class="nf">delete-char</span><span class="w"> </span><span class="mi">-1</span><span class="p">))))</span>
</pre></div>

<p>
The structure is the same, and the function will traverse over lines
the other direction too. Binding it to a key made it&nbsp;operational:
</p>

<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nf">define-key</span><span class="w"> </span><span class="nv">paredit-mode-map</span>
<span class="w">    </span><span class="p">(</span><span class="nf">kbd</span><span class="w"> </span><span class="s">"C-M-&lt;backspace&gt;"</span><span class="p">)</span><span class="w"> </span><span class="o">#</span><span class="ss">'sd/paredit-delete-whitespace</span><span class="p">)</span>
</pre></div>

<p>
In code like this, with point at&nbsp;the <code>|</code>:
</p>

<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nb">list</span><span class="w"> </span><span class="mi">1</span><span class="w"> </span><span class="mi">2</span>

<span class="w">     </span><span class="nv">|</span>

<span class="w">        </span><span class="p">)</span>
</pre></div>

<p>
pressing <code>C-M-&lt;backspace&gt;</code> deletes all that annoying&nbsp;whitespace:
</p>

<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nb">list</span><span class="w"> </span><span class="mi">1</span><span class="w"> </span><span class="mi">2</span><span class="p">)</span>
</pre></div>

<p>
Success! And I was happy for about five minutes, until I tested against&nbsp;this:
</p>

<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nb">list</span><span class="w"> </span><span class="mi">1</span><span class="w"> </span><span class="mi">2</span><span class="w"> </span><span class="mi">3</span>


<span class="w">     </span><span class="nv">|</span>

<span class="w">        </span><span class="mi">4</span><span class="w"> </span><span class="mi">5</span><span class="p">)</span>
</pre></div>

<p>
and ended up&nbsp;with:
</p>

<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nb">list</span><span class="w"> </span><span class="mi">1</span><span class="w"> </span><span class="mi">2</span><span class="w"> </span><span class="mi">34</span><span class="w"> </span><span class="mi">5</span><span class="p">)</span>
</pre></div>

<p>
Disaster! Well, not exactly, but annoying: if the whitespace happens
<i>not</i> to be closed by a bracket, there&#8217;s a danger of combining
characters together and changing the code&#8217;s behaviour. Not part of
the original problem specification, of course, but definitely&nbsp;undesirable.
</p>

<p>
Fortunately there&#8217;s a solution: teach the function some more Lisp.
Specifically, if after we&#8217;ve deleted the whitespace we&#8217;re not looking at
a closing bracket, we need to insert a space to avoid clashing
symbols together. (That&#8217;s how <i>little</i> Lisp we need the function to
know: or, to put it another way, how much Lisp&#8217;s lack of complicated
syntax simplifies manipulating its code.) We can check for brackets the
same way we checked for whitespace, using a character&#8217;s syntax
class. Adding this logic, plus some documentation and comments,&nbsp;gave:
</p>

<div class="highlight"><pre><span></span><span class="w">  </span><span class="p">(</span><span class="nf">defun</span><span class="w"> </span><span class="nv">sd/paredit-delete-whitespace</span><span class="w"> </span><span class="p">()</span>
<span class="w">    </span><span class="s">"Delete all whitespace around point.</span>

<span class="s">  Whitespace from point to the next non-whitespace symbol, and from point</span>
<span class="s">  back to the first non-whitespace symbol, is deleted. If doing so would</span>
<span class="s">  accidentally merge values then a single space is inserted. It is safe</span>
<span class="s">  to use this function within strings.</span>

<span class="s">  The implementation is based on `paredit-delete-leading-whitespace' but</span>
<span class="s">  is interactive, will cross line boundaries, and understands enough Lisp</span>
<span class="s">  to avoid accidents (hopefully)."</span>
<span class="w">    </span><span class="p">(</span><span class="nf">interactive</span><span class="p">)</span>
<span class="w">    </span><span class="p">(</span><span class="nf">save-excursion</span>
<span class="w">      </span><span class="c1">;; move forward to the next non-whitespace symbol</span>
<span class="w">      </span><span class="p">(</span><span class="k">while</span><span class="w"> </span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">syn</span><span class="w"> </span><span class="p">(</span><span class="nf">char-syntax</span><span class="w"> </span><span class="p">(</span><span class="nf">char-after</span><span class="p">))))</span>
<span class="w">               </span><span class="p">(</span><span class="k">and</span><span class="w"> </span><span class="p">(</span><span class="k">or</span><span class="w"> </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?</span><span class="err">\</span><span class="w"> </span><span class="p">)</span><span class="w">   </span><span class="c1">;; whitespace syntax classes</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?-</span><span class="p">)</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">eolp</span><span class="p">))</span><span class="w">        </span><span class="c1">;; line end</span>
<span class="w">                    </span><span class="p">(</span><span class="nb">not</span><span class="w"> </span><span class="p">(</span><span class="nf">paredit-in-char-p</span><span class="w"> </span><span class="p">(</span><span class="nb">1+</span><span class="w"> </span><span class="p">(</span><span class="nf">point</span><span class="p">))))))</span>
<span class="w">        </span><span class="p">(</span><span class="nf">forward-char</span><span class="p">))</span>

<span class="w">      </span><span class="c1">;; delete whitespace back from current position</span>
<span class="w">      </span><span class="p">(</span><span class="k">while</span><span class="w"> </span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">syn</span><span class="w"> </span><span class="p">(</span><span class="nf">char-syntax</span><span class="w"> </span><span class="p">(</span><span class="nf">char-before</span><span class="p">))))</span>
<span class="w">               </span><span class="p">(</span><span class="k">and</span><span class="w"> </span><span class="p">(</span><span class="k">or</span><span class="w"> </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?</span><span class="err">\</span><span class="w"> </span><span class="p">)</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="nv">syn</span><span class="w"> </span><span class="nv">?-</span><span class="p">)</span>
<span class="w">                        </span><span class="p">(</span><span class="nf">bolp</span><span class="p">)</span><span class="w">         </span><span class="c1">;; line start</span>
<span class="w">                    </span><span class="p">(</span><span class="nb">not</span><span class="w"> </span><span class="p">(</span><span class="nf">paredit-in-char-p</span><span class="w"> </span><span class="p">(</span><span class="nb">1-</span><span class="w"> </span><span class="p">(</span><span class="nf">point</span><span class="p">))))))</span>
<span class="w">        </span><span class="p">(</span><span class="nf">delete-char</span><span class="w"> </span><span class="mi">-1</span><span class="p">))</span>

<span class="w">      </span><span class="c1">;; if the current character isn't a closing bracket, and</span>
<span class="w">      </span><span class="c1">;; we're not in a string, add a space so we don't accidentally</span>
<span class="w">      </span><span class="c1">;; combine two numbers, symbols, strings, or whatever</span>
<span class="w">      </span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="nb">not</span><span class="w"> </span><span class="p">(</span><span class="k">or</span><span class="w"> </span><span class="p">(</span><span class="nf">eq</span><span class="w"> </span><span class="p">(</span><span class="nf">char-syntax</span><span class="w"> </span><span class="p">(</span><span class="nf">char-after</span><span class="p">))</span><span class="w"> </span><span class="nv">?</span><span class="err">\</span><span class="p">))</span>
<span class="w">                   </span><span class="p">(</span><span class="nf">paredit-in-string-p</span><span class="p">)))</span>
<span class="w">          </span><span class="p">(</span><span class="nf">insert</span><span class="w"> </span><span class="s">" "</span><span class="p">))))</span>
</pre></div>

<p>
And finally I was happy. I won&#8217;t be surprised if I now discover that
this functionality is built-in to paredit, or somewhere else in
Emacs – but I won&#8217;t be upset either. It&#8217;s been a good learning&nbsp;experience.
</p>
</div>
</div>
	    </div>
	</article>
</div>

	<!-- Social sharing section -->
  <div class="site-content">
    <div class="social">
      <ul>
<li><a onclick="MastodonShare(this);" data-src="A%20quick%20function%20to%20delete%20whitespace%20in%20Lisp%20programs%20%23emacs%20%23lisp&amp;url=https://simondobson.org/2023/01/13/a-quick-function-to-delete-whitespace-in-lisp-programs/"><span title="Share on Mastodon"><i class="fab fa-mastodon"></i></span></a></li>
	<li><a href="https://twitter.com/share?text=A%20quick%20function%20to%20delete%20whitespace%20in%20Lisp%20programs%20%23emacs%20%23lisp&amp;url=https://simondobson.org/2023/01/13/a-quick-function-to-delete-whitespace-in-lisp-programs/" target="_blak"><span title="Share on Twitter"><i class="fab
	fa-twitter"></i></span></a></li>
	<li><a href="https://www.reddit.com/submit?url=https://simondobson.org/2023/01/13/a-quick-function-to-delete-whitespace-in-lisp-programs/&amp;title=A%20quick%20function%20to%20delete%20whitespace%20in%20Lisp%20programs%20%23emacs%20%23lisp" target="_blank"><span title="Share on Reddit"><i class="fab fa-reddit"></i></span></a></li>
	<li><a href="https://www.linkedin.com/shareArticle?url=https://simondobson.org/2023/01/13/a-quick-function-to-delete-whitespace-in-lisp-programs/&amp;source=https://simondobson.org/" target="_blank"><span title="Share on LinkedIn"><i class="fab fa-linkedin"></i></span></a></li>
	<li><a href="mailto:?subject=A%20quick%20function%20to%20delete%20whitespace%20in%20Lisp%20programs&amp;body=https://simondobson.org/2023/01/13/a-quick-function-to-delete-whitespace-in-lisp-programs/"><span title="Share by email"><i class="fa fa-envelope"></i></span></a></li>
      </ul>
</div>
  </div>

	<!-- Tag Section -->
    <div class="site-content navigation-post">
	<div class="tag-head">Tags</div>
	<div class="tag-list">
		<a href="../../../../categories/emacs/">emacs</a>
		    <span>  </span>
		<a href="../../../../categories/lisp/">lisp</a>
	</div>
    </div>

	<!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
	    <a href="../../../../goodreads/unix-a-history-and-a-memoir/" rel="prev">
		<span class="meta-nav">Older Post</span><span class="caps">UNIX</span>: A History and a Memoir
	    </a>
	</div>
	<div class="next">
	    <a href="../../../../goodreads/plutoshine/" rel="next">
		<span class="meta-nav">Newer Post</span>Plutoshine
	    </a>
	</div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><script src="../../../../assets/js/mastodon-share.js"></script><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>